benchmark/report/rps/full/20260804_141226/raw/006_health_c1000_r1.txt
Running 20s test @ http://127.0.0.1:32775/api/health
  8 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   133.60ms  260.18ms   3.22s    92.24%
    Req/Sec     1.79k   327.57     2.98k    72.28%
  Latency Distribution
     50%   63.41ms
     75%   73.94ms
     90%  194.70ms
     99%    1.25s 
  285010 requests in 20.09s, 127.75MB read
Requests/sec:  14186.44
Transfer/sec:      6.36MB
HPS_WRK_REQUESTS 285010
HPS_WRK_STATUS_ERRORS 0
HPS_SOCKET_CONNECT 0
HPS_SOCKET_READ 0
HPS_SOCKET_WRITE 0
HPS_SOCKET_TIMEOUT 0
HPS_STATUS_TOTAL 285010
HPS_STATUS_2XX 285010
HPS_STATUS_NON_2XX 0
HPS_STATUS_UNEXPECTED 0
HPS_STATUS_CODES 200=285010